Tekla Open API Reference for Tekla Structures 2025
ConnectionCode Methods
The ComponentFilterExpressions.ConnectionCode type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ComponentFilterExpressions.ConnectionCode Class
Tekla.Structures.Filtering.Categories Namespace